{
  "disease": [
    {
      "name": "apple apple scab",
      "causative_agent": "Causative Agent: Venturia inaequalis",
      "symptoms": {
        "1": "1: Yellow or chlorotic spots on leaves.",
        "2": "2: May be a velvety growth on spots on undersides of leaves.",
        "3": "3: Twisting of leaves and Distorted leaves.",
        "4": "4: Dark olive green spots on leaves and fruit.",
        "5": "5: Severely infected leaves turn yellow and drop from tree."
      },
      "cause": "Cause: Fungus",
      "comments": {
        "1": "1: Fungus overwinters on dead foliage on ground.",
        "2": "2: spores dispersed by wind; high moisture encourages fungal growth."
      },
      "management": {
        "1": "1: Remove all leaves dropped from tree in the fall and compost to prevent any diseases surviving in debris.",
        "2": "2: Application of zinc and fertilizer grade urea in the Fall may be necessary to speed leaf drop, lime should then be added to fallen leaves.",
        "3": "3: Fungicide application may be necessary in areas where leaves remain wet for periods in excess of 9 hours.",
        "4": "4: Fungicides such as copper soaps and Bordeaux mixture should be applied if there is a chance of wet period as soon as leaf tips emerge."
      }
    },
    {
        "name": "apple black rot",
        "causative_agent": "Causative Agent: Botryosphaeria obtusa",
        "symptoms": {
          "1": "1: Purple flecks or circular lesions which are brown in the centre and purple at margin.",
          "2": "2: Red flecks, purple lesions and/or brown black rings on fruit.",
          "3": " ",
          "4": " ",
          "5": " "
        },
        "cause": "Cause: Fungus",
        "comments": {
          "1": "1: Spores can overwinter in twigs or fruit remaining on the tree and spread during rainfall.",
          "2": " "
        },
        "management": {
          "1": "1: Remove dead wood, mummified fruit and cankers from trees to reduce spread of disease.",
          "2": "2 Burn any prunings that have been made from the tree.",
          "3": "3: Disease can be controlled by applying fungicides from silver tip to harvest.",
          "4": " "
        }
      }
  ]
}